"```json\n{\n  \"story\": {\n    \"prompts\": [\n      \"A bright, bustling street in Rabat filled with colorful local shops and vendors. A 14-year-old girl with curly black hair pulled back in a messy bun, bright hazel eyes, and a sprinkle of freckles across her nose walks alongside her best friend, a boy with short, spiky bright blue hair and a bright smile. They glance around at the litter cluttering the streets. The girl wears an oversized green t-shirt with a graphic of Earth, denim shorts, and colorful flip-flops, while the boy dons a surfing t-shirt and cargo shorts. The scene captures a lively atmosphere as they engage in conversation, with sunlight illuminating the vibrant colors of the street.\",\n      \n      \"A close-up of the 14-year-old girl with curly black hair pulled back in a messy bun, bright hazel eyes, and freckles, bending down to pick up a discarded plastic bottle. She displays a determined expression that underlines her passion for the environment. The background remains a cluttered street, providing context to the issue. The panel emphasizes her resolve to make a difference as she holds the bottle tightly in her hand.\",\n      \n      \"Inside a cozy café decorated with plants and warm lighting, the 14-year-old girl and her best friend sit across from a passionate woman in her late 30s with long flowing black hair, wearing eco-friendly clothes and handmade recycled jewelry. The mentor figure gestures animatedly while explaining the impact of plastic waste on marine life, a colorful ocean conservation poster hanging in the background. Both teenagers look engaged, fully absorbing her words.\",\n      \n      \"The 14-year-old girl with curly hair and her best friend, still in the café, absorb the mentor's wisdom, with the girl now displaying an inspired expression. She shifts her gaze from the mentor to her best friend, sparking a moment of realization about their potential impact on their environment.\",\n      \n      \"Outside, the 14-year-old girl with curly black hair and her best friend are energetically putting up a brightly colored sign that reads 'Beach Cleanup Day!' The girl employs a bright smile, and the boy, with a contagious enthusiasm, helps in the process. In the background, a lively anthropomorphized plastic bottle character, complete with colorful eyes and limbs made from recycled materials, cheerfully raises its hands as if announcing its participation, adding humor and lightness to the scene.\",\n      \n      \"The 14-year-old girl with curly black hair and her best friend, both seated on park steps surrounded by lush greenery, fervently brainstorm ideas for their cleanup initiative. The girl, in a colorful oversized t-shirt, enthusiastically suggests innovative and playful cleanup games like 'plastic blob races', while her best friend, in bright casual attire, adds to the excitement with his lighthearted humor. The atmosphere is filled with creativity and ambition.\",\n      \n      \"In a local shop, the skeptical middle-aged business owner, wearing a modern twist on a traditional Moroccan jalaba, stands with his arms crossed, appearing doubtfully at the 14-year-old girl with curly black hair as she approaches him. The boy with bright blue hair stands confidently beside her, keen to support her initiative. They present their case for the cleaning supplies, setting the scene of tension but curiosity as they discuss the potential benefits for the community.\",\n      \n      \"Amidst the shop's shelves, the 14-year-old girl with a determined expression explains the advantages of a clean beach for tourism and community happiness to the skeptical business owner who looks more intrigued now, leaning slightly forward. Their conversation highlights the importance of collaboration and mutual benefits, showcasing the girl's leadership skills.\",\n      \n      \"A vibrant beach scene filled with community members of all ages actively participating in a cleanup. The sun shines brightly over the ocean, sparkling as people gather with bags to collect plastic waste. In the foreground, the lively anthropomorphized plastic bottle character joyfully directs participants, spreading its arms in cheer, creating an engaging atmosphere of teamwork and community spirit.\",\n      \n      \"The 14-year-old girl with curly hair and her best friend, enthusiastically organizing a friendly competition amidst the beach cleanup. They hold colored flags marking collected bags while displaying playful expressions. The excitement in the air is palpable as the boy challenges participants, setting the tone for a fun and cooperative effort. Their surroundings reflect the dynamic activity happening on the shores.\",\n      \n      \"A striking before-and-after split panel showcasing a beach transformation—one side cluttered with plastic waste and the other pristine and clear, full of smiling faces enjoying the clean environment. Above, an off-panel voice from the mentor character echoes the message of the community's efforts making a real difference, highlighting the positive impact of their hard work.\",\n      \n      \"The 14-year-old girl with curly black hair stands proudly on a sunny beach with friends, holding trash bags with big smiles. The scene is filled with joy and achievement as they pose for a group photo under a clear blue sky, embodying the spirit of successful teamwork and environmental stewardship.\",\n      \n      \"On a rocky outcrop overlooking the ocean, the 14-year-old girl with curly black hair gazes into the distance, symbolizing hope and determination. Behind her, the vast blue ocean stretches out, emphasizing the importance of their mission. The inspirational atmosphere builds as she declares her commitment to continue their efforts, encouraging others to join in.\",\n      \n      \"A bright and inviting graphic emblazoned with the words: 'Join your local cleanup! Protect our oceans and wildlife!' The message is accompanied by images of smiling community members and clean beaches, intended to inspire others to take action. It serves as a powerful call to action, emphasizing the collective responsibility in making a positive change for the environment.\"\n    ]\n  }\n}\n```"